a=input('Здравствуйте! Как Вас зовут? ')
print(f'Очень приятно,{a}! Меня зовут Марк. ')
b=int(input('Сколько Вам лет? '))
age=78
if b>age:
    y=b-age
    print(f'Да, {a}, Вы старше меня на {y} лет. ')
else:
    y=age-b
    print(f'Да, {a}, я старше Вас на {y} лет. ')
u=input('Вам нравится программировать?')
if u=='да':
    print('Превосходно! Уверен, у Вас получится написать множество полезных и хороших программ.  ')
else:
    print('Жаль. Я думал, Вы сможете написать интересную программу для меня.  ')